---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShape
source: html/903a43dd-5681-3f27-fcd4-92ea8260f3a0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShape Property

"Shape"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShape { get; }
```